{"class_name": "Functional", "config": {"name": "ProposedModel-EFNB0-SeLU-STUDENT-Final", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1-a-b-a-b"}, "name": "input_1-a-b-a-b", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_2-a", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling_2-a", "inbound_nodes": [[["input_1-a-b-a-b", 0, 0, {}]]]}, {"class_name": "Rescaling", "config": {"name": "rescaling_3-b", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling_3-b", "inbound_nodes": [[["input_1-a-b-a-b", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_2-a", "trainable": true, "dtype": "float32", "axis": [3]}, "name": "normalization_2-a", "inbound_nodes": [[["rescaling_2-a", 0, 0, {}]]]}, {"class_name": "Normalization", "config": {"name": "normalization_3-b", "trainable": true, "dtype": "float32", "axis": [3]}, "name": "normalization_3-b", "inbound_nodes": [[["rescaling_3-b", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad-a", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "stem_conv_pad-a", "inbound_nodes": [[["normalization_2-a", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad-b", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "stem_conv_pad-b", "inbound_nodes": [[["normalization_3-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv-a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv-a", "inbound_nodes": [[["stem_conv_pad-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv-b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv-b", "inbound_nodes": [[["stem_conv_pad-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn-a", "inbound_nodes": [[["stem_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn-b", "inbound_nodes": [[["stem_conv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "stem_activation-a", "inbound_nodes": [[["stem_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "stem_activation-b", "inbound_nodes": [[["stem_bn-b", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv-a", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1a_dwconv-a", "inbound_nodes": [[["stem_activation-a", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv-b", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block1a_dwconv-b", "inbound_nodes": [[["stem_activation-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_bn-a", "inbound_nodes": [[["block1a_dwconv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_bn-b", "inbound_nodes": [[["block1a_dwconv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1a_activation-a", "inbound_nodes": [[["block1a_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block1a_activation-b", "inbound_nodes": [[["block1a_bn-b", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze-a", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block1a_se_squeeze-a", "inbound_nodes": [[["block1a_activation-a", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze-b", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block1a_se_squeeze-b", "inbound_nodes": [[["block1a_activation-b", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1a_se_reshape-a", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1a_se_reshape-a", "inbound_nodes": [[["block1a_se_squeeze-a", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block1a_se_reshape-b", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 32]}, "name": "block1a_se_reshape-b", "inbound_nodes": [[["block1a_se_squeeze-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_reduce-a", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_reduce-a", "inbound_nodes": [[["block1a_se_reshape-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_reduce-b", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_reduce-b", "inbound_nodes": [[["block1a_se_reshape-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_expand-a", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_expand-a", "inbound_nodes": [[["block1a_se_reduce-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_se_expand-b", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_se_expand-b", "inbound_nodes": [[["block1a_se_reduce-b", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1a_se_excite-a", "trainable": true, "dtype": "float32"}, "name": "block1a_se_excite-a", "inbound_nodes": [[["block1a_activation-a", 0, 0, {}], ["block1a_se_expand-a", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block1a_se_excite-b", "trainable": true, "dtype": "float32"}, "name": "block1a_se_excite-b", "inbound_nodes": [[["block1a_activation-b", 0, 0, {}], ["block1a_se_expand-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv-a", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv-a", "inbound_nodes": [[["block1a_se_excite-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv-b", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv-b", "inbound_nodes": [[["block1a_se_excite-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn-a", "inbound_nodes": [[["block1a_project_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn-b", "inbound_nodes": [[["block1a_project_conv-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv-a", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv-a", "inbound_nodes": [[["block1a_project_bn-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv-b", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv-b", "inbound_nodes": [[["block1a_project_bn-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn-a", "inbound_nodes": [[["block2a_expand_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn-b", "inbound_nodes": [[["block2a_expand_conv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation-a", "inbound_nodes": [[["block2a_expand_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation-b", "inbound_nodes": [[["block2a_expand_bn-b", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad-a", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block2a_dwconv_pad-a", "inbound_nodes": [[["block2a_expand_activation-a", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad-b", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block2a_dwconv_pad-b", "inbound_nodes": [[["block2a_expand_activation-b", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv-a", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2a_dwconv-a", "inbound_nodes": [[["block2a_dwconv_pad-a", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv-b", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2a_dwconv-b", "inbound_nodes": [[["block2a_dwconv_pad-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_bn-a", "inbound_nodes": [[["block2a_dwconv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_bn-b", "inbound_nodes": [[["block2a_dwconv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_activation-a", "inbound_nodes": [[["block2a_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2a_activation-b", "inbound_nodes": [[["block2a_bn-b", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze-a", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2a_se_squeeze-a", "inbound_nodes": [[["block2a_activation-a", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze-b", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2a_se_squeeze-b", "inbound_nodes": [[["block2a_activation-b", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2a_se_reshape-a", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "block2a_se_reshape-a", "inbound_nodes": [[["block2a_se_squeeze-a", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2a_se_reshape-b", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "block2a_se_reshape-b", "inbound_nodes": [[["block2a_se_squeeze-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_reduce-a", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_reduce-a", "inbound_nodes": [[["block2a_se_reshape-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_reduce-b", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_reduce-b", "inbound_nodes": [[["block2a_se_reshape-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_expand-a", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_expand-a", "inbound_nodes": [[["block2a_se_reduce-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_se_expand-b", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_se_expand-b", "inbound_nodes": [[["block2a_se_reduce-b", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2a_se_excite-a", "trainable": true, "dtype": "float32"}, "name": "block2a_se_excite-a", "inbound_nodes": [[["block2a_activation-a", 0, 0, {}], ["block2a_se_expand-a", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2a_se_excite-b", "trainable": true, "dtype": "float32"}, "name": "block2a_se_excite-b", "inbound_nodes": [[["block2a_activation-b", 0, 0, {}], ["block2a_se_expand-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv-a", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv-a", "inbound_nodes": [[["block2a_se_excite-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv-b", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv-b", "inbound_nodes": [[["block2a_se_excite-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn-a", "inbound_nodes": [[["block2a_project_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn-b", "inbound_nodes": [[["block2a_project_conv-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv-a", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv-a", "inbound_nodes": [[["block2a_project_bn-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv-b", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv-b", "inbound_nodes": [[["block2a_project_bn-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn-a", "inbound_nodes": [[["block2b_expand_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn-b", "inbound_nodes": [[["block2b_expand_conv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation-a", "inbound_nodes": [[["block2b_expand_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation-b", "inbound_nodes": [[["block2b_expand_bn-b", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv-a", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2b_dwconv-a", "inbound_nodes": [[["block2b_expand_activation-a", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv-b", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block2b_dwconv-b", "inbound_nodes": [[["block2b_expand_activation-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_bn-a", "inbound_nodes": [[["block2b_dwconv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_bn-b", "inbound_nodes": [[["block2b_dwconv-b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_activation-a", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_activation-a", "inbound_nodes": [[["block2b_bn-a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_activation-b", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "block2b_activation-b", "inbound_nodes": [[["block2b_bn-b", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze-a", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2b_se_squeeze-a", "inbound_nodes": [[["block2b_activation-a", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze-b", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "block2b_se_squeeze-b", "inbound_nodes": [[["block2b_activation-b", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2b_se_reshape-a", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block2b_se_reshape-a", "inbound_nodes": [[["block2b_se_squeeze-a", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block2b_se_reshape-b", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 144]}, "name": "block2b_se_reshape-b", "inbound_nodes": [[["block2b_se_squeeze-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_reduce-a", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_reduce-a", "inbound_nodes": [[["block2b_se_reshape-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_reduce-b", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_reduce-b", "inbound_nodes": [[["block2b_se_reshape-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_expand-a", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_expand-a", "inbound_nodes": [[["block2b_se_reduce-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_se_expand-b", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_se_expand-b", "inbound_nodes": [[["block2b_se_reduce-b", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2b_se_excite-a", "trainable": true, "dtype": "float32"}, "name": "block2b_se_excite-a", "inbound_nodes": [[["block2b_activation-a", 0, 0, {}], ["block2b_se_expand-a", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block2b_se_excite-b", "trainable": true, "dtype": "float32"}, "name": "block2b_se_excite-b", "inbound_nodes": [[["block2b_activation-b", 0, 0, {}], ["block2b_se_expand-b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv-a", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv-a", "inbound_nodes": [[["block2b_se_excite-a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv-b", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv-b", "inbound_nodes": [[["block2b_se_excite-b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn-a", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn-a", "inbound_nodes": [[["block2b_project_conv-a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn-b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn-b", "inbound_nodes": [[["block2b_project_conv-b", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2b_drop-a", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2b_drop-a", "inbound_nodes": [[["block2b_project_bn-a", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2b_drop-b", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2b_drop-b", "inbound_nodes": [[["block2b_project_bn-b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add-a", "trainable": true, "dtype": "float32"}, "name": "block2b_add-a", "inbound_nodes": [[["block2b_drop-a", 0, 0, {}], ["block2a_project_bn-a", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add-b", "trainable": true, "dtype": "float32"}, "name": "block2b_add-b", "inbound_nodes": [[["block2b_drop-b", 0, 0, {}], ["block2a_project_bn-b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "FusionLayer", "trainable": true, "dtype": "float32"}, "name": "FusionLayer", "inbound_nodes": [[["block2b_add-a", 0, 0, {}], ["block2b_add-b", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d", "inbound_nodes": [[["FusionLayer", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["depthwise_conv2d", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.selu", "trainable": true, "dtype": "float32", "function": "nn.selu"}, "name": "tf.nn.selu", "inbound_nodes": [["batch_normalization", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "LecunNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["tf.nn.selu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.selu_1", "trainable": true, "dtype": "float32", "function": "nn.selu"}, "name": "tf.nn.selu_1", "inbound_nodes": [["batch_normalization_1", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "LecunNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["tf.nn.selu_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "ResidualFusion", "trainable": true, "dtype": "float32"}, "name": "ResidualFusion", "inbound_nodes": [[["FusionLayer", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d", "inbound_nodes": [[["ResidualFusion", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "softmaxProposedModel-EFNB0-SeLU-STUDENT", "trainable": true, "dtype": "float32", "units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "softmaxProposedModel-EFNB0-SeLU-STUDENT", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}], "input_layers": [["input_1-a-b-a-b", 0, 0]], "output_layers": [["softmaxProposedModel-EFNB0-SeLU-STUDENT", 0, 0]]}, "keras_version": "2.5.0", "backend": "tensorflow"}